"""
## 디스크 컨트롤러

하드디스크는 한 번에 하나의 작업만 수행할 수 있습니다.
디스크 컨트롤러를 구현하는 방법은 여러 가지가 있습니다.
가장 일반적인 방법은 요청이 들어온 순서대로 처리하는 것입니다.

예를들어
- 0ms 시점에 3ms가 소요되는 A작업 요청
- 1ms 시점에 9ms가 소요되는 B작업 요청
- 2ms 시점에 6ms가 소요되는 C작업 요청
와 같은 요청이 들어왔습니다.

한 번에 하나의 요청만을 수행할 수 있기 때문에
각각의 작업을 요청받은 순서대로 처리하면 다음과 같이 처리 됩니다.
- A: 3ms 시점에 작업 완료 (요청에서 종료까지 : 3ms)
- B: 1ms부터 대기하다가, 3ms 시점에 작업을 시작해서 12ms 시점에 작업 완료(요청에서 종료까지 : 11ms)
- C: 2ms부터 대기하다가, 12ms 시점에 작업을 시작해서 18ms 시점에 작업 완료(요청에서 종료까지 : 16ms)
이 때 각 작업의 요청부터 종료까지 걸린 시간의 평균은 10ms(= (3 + 11 + 16) / 3)가 됩니다.

하지만 A → C → B 순서대로 처리하면
- A: 3ms 시점에 작업 완료(요청에서 종료까지 : 3ms)
- C: 2ms부터 대기하다가, 3ms 시점에 작업을 시작해서 9ms 시점에 작업 완료(요청에서 종료까지 : 7ms)
- B: 1ms부터 대기하다가, 9ms 시점에 작업을 시작해서 18ms 시점에 작업 완료(요청에서 종료까지 : 17ms)
이렇게 A → C → B의 순서로 처리하면
각 작업의 요청부터 종료까지 걸린 시간의 평균은 9ms(= (3 + 7 + 17) / 3)가 됩니다.

각 작업에 대해 [작업이 요청되는 시점, 작업의 소요시간]을 담은 2차원 배열 jobs가 매개변수로 주어질 때,
작업의 요청부터 종료까지 걸린 시간의 평균을 가장 줄이는 방법으로 처리하면 평균이 얼마가 되는지 return 하도록
solution 함수를 작성해주세요. (단, 소수점 이하의 수는 버립니다)
"""
import heapq


def solution(jobs):
    # Shortest Job First 스케줄링 구현
    # answer: 총 걸린 시간
    # time: 시간 포인터
    # last: 최근 끝난 시간
    answer, time, last = 0, 0, -1
    heap = []
    n = len(jobs)
    jobs.sort()

    # count: 처리 작업 수
    count = 0
    while count < n:
        for s, t in jobs:
            # 현재 작업이 시작되는 지점과 이전 작업이 끝나는 지점이 겹쳐지는 경우
            # 해당 작업의 대기 시간을 더해줌
            if last < s <= time:
                answer += (time - s)
                heapq.heappush(heap, t)

        if len(heap) > 0:
            # 첫번째 작업이 끝날 때까지 힙에 존재하는 모든 작업들의 시간은 소요됨
            answer += len(heap) * heap[0]
            last = time
            time += heapq.heappop(heap)
            count += 1
        else:
            time += 1

    return answer // n


if __name__ == '__main__':
    print(solution([[0, 3], [1, 9], [2, 6]])) # 9
